FILES/Catalogs/ПользователиОБТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ПользователиОБТ</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Командируемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Командированные</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Comment>ХешПароля</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FILES/Catalogs/ПользователиОБТ/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПослеВводаСтроки(Строка, Параметры) Экспорт
    Если НЕ Строка = Неопределено Тогда
		Объект.Пароль = УправлениеБТВызовСервера.md5Стандарт(УправлениеБТВызовСервера.MD5ХешСтрока(Строка));
		Объект.Данные = Строка;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПарольНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Подсказка = "Введите пароль";
	Оповещение = Новый ОписаниеОповещения("ПослеВводаСтроки", ЭтаФорма, Новый Структура());
	ПоказатьВводСтроки(Оповещение, Объект.Данные, Подсказка, 0, Истина);
КонецПроцедуры

&НаКлиенте
Процедура КомандируемыйПриИзменении(Элемент)
	Если Объект.Наименование = "" Тогда
		Объект.Наименование = Строка(Объект.Командируемый);
	КонецЕсли;
КонецПроцедуры
